---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurvePath3d
source: html/ebe5122c-e07a-28b4-5cdf-62bb040e6be9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurvePath3d Property

More than one curve not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotOneCurvePath3d { get; }
```